/*
 * Copyright (C) 2020-2021 Shenzhen SMIC Education Technology Co., Ltd
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Loongson 1B Bare Program, Sample main file
 */

#include <stdio.h>

#include "ls1b.h"
#include "mips.h"

//-------------------------------------------------------------------------------------------------
// BSP
//-------------------------------------------------------------------------------------------------

#include "bsp.h"

#include "Timing.h"
                         
//-------------------------------------------------------------------------------------------------
// 主程序
//-------------------------------------------------------------------------------------------------
/********************************************************************************************************************
**** 版权所有：  Shenzhen SMIC Education Technology Co., Ltd
**** 程序名称：   main
**** 设计者:      Mr.hao    日期：2021年11月1日
**** 修改者:      Mr.hao     日期：2021年11月1日
**** 功  能：       定时器LED闪烁功能
**** 版本信息:    V0.1
**** 说  明：    程序运行时，开发板上的LED灯间隔1S闪烁一次
********************************************************************************************************************/
int main(void)
{
    printk("\r\nmain() function.\r\n");
    
    unsigned char i;
    
    Timing_init();

    /*
     * 裸机主循环
     */
    for (;;)
    {
        TimingDis();//LED灯
    }

    return 0;
}



